app/controllers/products_controller.rb

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "title" = ?, "description" = ?, "image_url" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "Lorem Ipsum"], ["description", "Wibbles are fun!"], ["image_url", "lorem.jpg"], ["price", 19.95], ["updated_at", "2015-05-26 13:50:40.558221"], ["id", 980190962]]